{
  "meta": {
    "title": "Mega Adult Pack",
    "description": "520 mature, non-graphic Truth & Dare prompts for 18+ players. Categories: friends, couples, lovers, sex_mate.",
    "created_at": "2025-12-03T00:00:00Z",
    "author": "STYLES"
  },
  "packs": {
    "friends": {
      "truths": [
        "Who in this group would you secretly call if you needed a late-night confidante? Explain in 1-2 sentences.",
        "Have you ever had a crush on someone you met through a friend? Tell us briefly.",
        "What's the most romantic compliment you've ever received from a friend or acquaintance?",
        "Have you ever been tempted to kiss someone in this room? If comfortable, say who or describe the feeling.",
        "What's a private attraction you've felt that surprised you?",
        "Who here would you trust to keep a romantic secret and why?",
        "Have you ever flirted with someone while pretending it was a joke? What happened?",
        "What's the boldest romantic text you've ever sent (non-explicit)?",
        "Have you ever fantasized about someone you later realised wasn't available? Describe briefly.",
        "What's a subtle sign you give when you're attracted to someone?",
        "Have you ever purposely extended a goodbye because you liked the person? Tell us.",
        "Tell us about the most flattering romantic gesture anyone has made for you.",
        "Have you ever been attracted to a friend's partner? How did you handle it?",
        "What's one thing you find irresistibly charming, but rarely admit?",
        "What's an affectionate nickname you secretly liked being called?",
        "When did you last feel a sudden closeness with someone unexpectedly? Describe.",
        "What's the most romantic daydream you've had recently?",
        "Have you ever given someone an emotional compliment that meant a lot? What was it?",
        "Which non-physical quality do you find most attractive in someone here?",
        "Have you ever played coy with someone to see if they'd chase you? What happened?",
        "Which song would you dedicate to someone in this group right now and why?",
        "What's one romantic fear you have around relationships?",
        "Have you ever felt butterflies around someone unexpectedly? Who or what triggered it?",
        "What's something small someone did that made you see them differently romantically?",
        "Have you ever wished someone noticed you more? Describe the wish.",
        "What's one phrase that melts you when someone says it respectfully?",
        "Have you ever turned down a date you later regretted? What stopped you?",
        "What's a quality you admire that people often overlook in potential partners?",
        "Have you ever kept a romantic interest secret to protect a friendship? Why?",
        "What's an innocent flirt you tried that surprisingly worked?",
        "Describe, briefly, your most memorable shy compliment moment.",
        "Have you ever been jealous for a reason you later laughed about? Tell us why.",
        "What's a small, sweet habit in someone that you find endearing?",
        "Have you ever felt a spark while helping someone? What was the situation?",
        "What's an unexpected trait that quickly made you attracted to someone?",
        "Have you ever felt guilty about flirting? Why?",
        "What's a kind, romantic thing you've wanted to say but haven't yet?",
        "Have you ever re-read a message from someone because it made you smile? Share.",
        "What's one thing you secretly love to be told by someone you're attracted to?",
        "Have you ever flirted through song lyrics? Which line did you use?",
        "What's the most romantic compliment you could imagine receiving now?",
        "Have you ever initiated a subtle touch to see the response? What happened?",
        "What's a crush story you laugh about now but felt serious at the time?",
        "Have you ever kept a keepsake from a romantic moment? What is it?",
        "What's one small risk you'd take to get to know someone better?",
        "Have you ever written a short note for someone and never delivered it? What did it say?",
        "What's the most sincere romantic advice you've ever received?",
        "Have you ever been surprised by your own attraction to someone unexpected?",
        "What's a private romantic preference you rarely voice aloud?",
        "Have you ever tried to create a 'moment' with someone? How did it go?",
        "What's one thing that makes you feel noticed and appreciated?",
        "Have you ever shared a secret glance with someone? Describe how it felt.",
        "What's a non-physical gesture that instantly impresses you?",
        "Have you ever had a 'what if' thought about a past interaction? Share briefly.",
        "What's the sweetest thing anyone has said to you that you still remember?",
        "Have you ever acted differently around someone you liked? How so?",
        "What's one romantic value you refuse to compromise on?"
      ],
      "dares": [
        "Send a short, flirtatious message to a consenting friend and show the reply.",
        "Whisper a playful compliment into the ear of the person on your left (consent first).",
        "Describe a brief romantic scenario in 30 seconds with tasteful language.",
        "Give the person opposite you a sincere compliment for 20 seconds.",
        "Perform a slow-motion, playful walk across the room for 10 seconds.",
        "Share a favorite romantic song line out loud and say why it matters to you.",
        "Dance beside someone for 20 seconds (consent required).",
        "Take a selfie with a friend making your best ‘flirty’ face and show the group.",
        "Send a short voice note to someone saying 'You made me smile today' and play the reply.",
        "Write a one-line playful poem about someone in the room (consenting) and read it.",
        "Ask a consenting person for a 5-second hug and hold it gently.",
        "Perform a light-hearted impression of a beloved romantic hero for 20 seconds.",
        "Give a 20-second appreciation speech about why friends matter, using affectionate tone.",
        "Offer to swap accessories (hat, scarf) with someone for a moment and pose for a photo.",
        "Recite a two-line romantic stanza dramatically.",
        "Share a small secret about a time you felt unexpectedly close to someone.",
        "Tell a short, tasteful story about an early crush you had.",
        "Let someone whisper a sweet line to you (consent) and repeat it with a smile.",
        "Write a brief, encouraging message for someone and read it aloud.",
        "Act out a scene where you unexpectedly meet your crush, PG-style.",
        "Speak in a flirtatious accent for the next two rounds of play.",
        "Trade a light, playful compliment with someone and show the group.",
        "Say one thing you find charming about the person to your right (consent).",
        "Share a childhood crush memory in one sentence.",
        "Read one gentle line from a romantic poem as if auditioning for a film.",
        "Compliment someone's laugh or smile and explain why it's memorable.",
        "Perform 15 seconds of charming air guitar to a romantic tune.",
        "Write a short, tasteful headline about a romantic moment and read it out.",
        "Pose for a dramatic romantic poster with a consenting partner and show the photo.",
        "Tell the group about a small romantic gesture you once received that stuck with you.",
        "Demonstrate your best 'movie kiss reaction' (no contact) for comedic effect.",
        "Name one quality you'd notice first on a potential crush and explain why.",
        "Create a two-line flirty caption for someone (consent) and share it.",
        "Pretend to serenade someone with 20 seconds of humming a love song.",
        "Offer a sincere compliment about someone's eyes (consenting).",
        "Share a short, sweet 'remember when' moment with someone you're comfortable with.",
        "Write a 2-line 'future date idea' and present it like it's a pitch.",
        "Tell someone you appreciate one small thing they do and why it matters.",
        "Act out a playful, flirtatious 'walk by' for 10 seconds.",
        "Share a tasteful story about a romantic surprise you would plan.",
        "Read aloud a single, positive love quote and dedicate it to the group.",
        "Give a 15-second, heartfelt reason you value friendship and light romance.",
        "Offer a gentle apology for a past awkward moment and say what you'd do differently.",
        "Make a short, flirtatious joke directed at a consenting person.",
        "Pick a song you'd pair with someone here and explain your choice.",
        "Swap a memory about a crush with someone and laugh about the outcome.",
        "Take a playful pose with a consenting friend and hold it for a snapshot.",
        "Tell the group what kind of first date would impress you most.",
        "Share a short compliment with someone about their personality trait.",
        "Write a small, encouraging note for someone and show it to the group.",
        "Whisper a charming, plot-like line to someone and make it dramatic.",
        "Demonstrate a 10-second 'romantic' entrance as if on stage.",
        "Read a two-line flirtatious text languidly and then laugh about it.",
        "Tell the group the most flattering thing someone can say to you.",
        "Act out a sweet, non-physical wedding toast line for someone imaginary.",
        "Share a one-liner pick-up line tastefully to make people smile.",
        "Offer to lead a 20-second group clap for friendship and supportive gestures.",
        "Write and perform a one-sentence movie trailer for a romantic comedy starring someone here.",
        "Do a short, playful 'slow-motion' romantic pose with someone consenting."
      ]
    },
    "couples": {
      "truths": [
        "What's the first thought you remember when you first met your partner?",
        "Describe the small habit of your partner that you secretly adored at first.",
        "Have you ever surprised your partner spontaneously? What did you do?",
        "What's one vulnerability you wish your partner understood better?",
        "What was your most memorable shared laugh with your partner?",
        "Have you ever made a romantic mistake and learned from it? Describe briefly.",
        "What's a private promise you've made to yourself in this relationship?",
        "When did you first feel truly seen by your partner?",
        "How do you like to be comforted when you're upset by your partner?",
        "What's a small change you'd like that would make daily life sweeter with your partner?",
        "What's a tiny ritual you enjoy with your partner that others might overlook?",
        "Have you ever felt butterflies again during your relationship? What sparked it?",
        "What's something you appreciate that your partner does without announcing it?",
        "When did you last feel proud of your partner and why?",
        "What's a small act of affection you want to do more often?",
        "Have you kept a tiny memory from your relationship? Describe what and why.",
        "What's a conversation you wish you'd had earlier in the relationship?",
        "When did you both laugh so hard you couldn't stop? Share the short story.",
        "What's one romantic dream you still hope to make happen together?",
        "How do you show appreciation in small everyday ways?",
        "What's a little habit of your partner that still surprises you in a good way?",
        "What's one boundary that has helped your relationship grow?",
        "When did you first say 'I love you' and how was it shared?",
        "What's a small compliment from your partner that means a lot to you?",
        "What's a lighthearted secret you share that always makes both of you smile?",
        "What's a tiny thing you do to show you care that your partner notices?",
        "What's one spontaneous plan you'd make for your partner this month?",
        "What's a small, meaningful gift you gave or received that stuck with you?",
        "What's an everyday moment that you find unexpectedly romantic in your relationship?",
        "What's one thing you learned about love since being together?",
        "What's an affectionate quirk you adore about your partner?",
        "When did you most recently feel deeply connected to your partner? Describe briefly.",
        "What's a short piece of advice you'd give to the early days of your relationship?",
        "What's a gentle compromise that made your relationship stronger?",
        "What's one small change you both agreed to that helped the relationship?",
        "What's a shared moment that still makes you smile when you think about it?",
        "What's a low-key date idea you think your partner would love?",
        "Have you ever written a short note for your partner and saved it? What did it say?",
        "What's an everyday song that reminds you of your partner?",
        "What's a little tradition you've formed together that means a lot?",
        "What's one small romantic risk you took that paid off?",
        "What's one quality of your partner that made you feel safe?",
        "What's a favorite, quiet morning memory you share?",
        "What's an act of kindness from your partner that changed your day?",
        "What's a short message you'd love to receive from your partner today?",
        "When did you most recently surprise each other and how did it land?",
        "What's a small thing that signals to you that your partner cares deeply?",
        "What's one short promise you'd make to your partner for the coming month?",
        "What's something you appreciate about how your partner handles tough times?",
        "What's a story about you two that always makes guests smile?",
        "What's one simple pleasure you enjoy together on ordinary days?",
        "What small compliment from your partner do you never tire of hearing?",
        "What's a tiny challenge you overcame together, and how did it bring you closer?",
        "What's one gentle way you like being reassured by your partner?",
        "What's a small, considerate thing you do that you wish they noticed more often?",
        "What's one thing you hope to learn together in the next year?",
        "What's one short note you'd leave for your partner to find tomorrow?",
        "When do you feel most proud to call your partner 'partner'?"
      ],
      "dares": [
        "Give your partner a sincere, uninterrupted 30-second compliment about who they are.",
        "Recreate a tiny memorable moment from your first date together (just the mood).",
        "Plan a 60-second imaginary surprise weekend and present it lovingly.",
        "Give your partner a 20-second back or shoulder massage (consent first).",
        "Write a short promise on a note and give it to your partner to keep.",
        "Slow-dance together to a song you both like for 30 seconds.",
        "Share one of your favorite memories together and act it out lightly.",
        "Close your eyes and whisper one small wish for your relationship into your partner's ear.",
        "Make a quick list of three things you'll do this week to show love and read it aloud.",
        "Pretend to write a romantic postcard to your partner and read it dramatically.",
        "Switch roles for 60 seconds and imitate how the other shows affection (playful).",
        "Take a short selfie together making your 'most in-love' faces and show it.",
        "Offer a five-second 'thank you' speech about your partner's kindness.",
        "Describe your perfect simple date for next month in one minute and make it sound exciting.",
        "Give your partner a staged 'surprise' by revealing a short promise you will do for them.",
        "Read a brief line from a romantic poem or song and dedicate it to them.",
        "Trade a small token (like a wristband) to wear for the next hour as a playful sign.",
        "List three things you appreciate about your partner right now and share them.",
        "Share a short, sincere apology for a small thing and say how you'll change it.",
        "Pose for a pretend magazine cover photo together (playful) and hold the pose for a snapshot.",
        "Create a two-sentence future 'we' statement and say it with conviction.",
        "Do a gentle, consenting forehead-to-forehead pause for ten seconds.",
        "Gift your partner a 20-second monologue of what you love most about them.",
        "Bring a small imaginary picnic idea to life verbally — describe the taste, place, and mood.",
        "Whisper the cheesiest thing you can imagine to your partner and then laugh together.",
        "Share one short hope you have for you both in the next year.",
        "Draw, in the air, a tiny map of a dream date and explain it aloud.",
        "Offer to take over one small chore tomorrow as a written pledge.",
        "Make a quick collage of three words that describe your partner and show it out loud.",
        "Give your partner permission to ask you any harmless question and answer it honestly.",
        "Perform a short, playful 'romantic' commercial pitch about your partner.",
        "Create a tiny fictional story where the two of you save the day and tell it in 30 seconds.",
        "Describe a cozy night-in scenario and promise to make it happen this month.",
        "Sing two lines of a romantic chorus devoted to your partner (no pressure to be perfect).",
        "Write a short 'open when' note title and read it out loud as a promise.",
        "Make a quick list of three small adventures you'd like to try together and present them.",
        "Recite a mini toast to your partner imagining friends cheering you on.",
        "Whisper a single, sincere compliment and then explain why it matters to you.",
        "Create a 20-second charade representing a memory you both share and mime it.",
        "Offer a tactile compliment (like 'your hands are gentle') if your partner consents.",
        "Perform a 15-second 'gratitude' burst listing the small things your partner does.",
        "Read aloud one line from a note you'd secretly love to receive from your partner.",
        "Share a brief dream about a future holiday and why you'd enjoy it together.",
        "Write a one-line vow to yourself about how to be a better partner this week.",
        "Pretend to be a travel guide describing the perfect date town for your partner.",
        "List three tiny surprises you'd like to do within a month and choose one to commit to.",
        "Do a 20-second 'thank you' hug simulation (consent) with theatrical sincerity.",
        "Create a quick 'couple's motto' of two words and explain its meaning.",
        "Share one small habit you will start to show more care and set a date to begin.",
        "Make an imaginary promise ring presentation (playful) explaining its symbolism.",
        "Describe one comforting thing you want your partner to know about your love language.",
        "Write a two-line 'why I love you' and read it with feeling.",
        "Offer a 30-second story about a silly argument you overcame and what it taught you.",
        "Make a promise to plan one small romantic ritual each week for a month and announce the first."
      ]
    },
    "lovers": {
      "truths": [
        "What's a non-explicit romantic fantasy you've had that felt meaningful to you?",
        "What do you find most magnetic in someone's personality when you're attracted?",
        "Have you ever had a moment of instant attraction that surprised you? Describe briefly.",
        "What small, thoughtful action makes you feel most desired?",
        "Have you ever pursued someone in an unexpected way? What did you do?",
        "What's one intimate communication you wish all partners understood about you?",
        "What's your favorite kind of affectionate attention to receive?",
        "Has a simple touch ever changed how you felt about someone? Share briefly.",
        "What's one thing you admire about the way someone flirts respectfully?",
        "Have you ever felt a romantic connection that you couldn't explain? What triggered it?",
        "What's the kindest romantic gesture you've ever made or received?",
        "What's one thing you do to make your partner feel prioritized?",
        "Have you ever written a poem or line for someone? What inspired it?",
        "What's one quality that immediately draws you to someone at first sight?",
        "What's a private compliment you once received that stayed with you?",
        "What gentle flirting habit from someone made your heart jump?",
        "Have you ever felt shy about expressing desire? When and why?",
        "What's a small sign that tells you someone is truly interested in you?",
        "What's one affectionate thing you think about doing but haven't tried yet?",
        "Have you ever been surprised by your own willingness to be vulnerable? Tell us.",
        "What's a romantic preference you have that you seldom share?",
        "What non-physical trait do you most associate with chemistry?",
        "Have you ever felt an electric moment in public? What was it like?",
        "What's a short, meaningful compliment you always keep in mind to use?",
        "What's one thing you hope a new partner would understand about you?",
        "Have you ever been moved to tears by a loving act? Describe briefly.",
        "What's one small behavior that instantly makes you trust someone more?",
        "Have you ever risked embarrassment to show interest? What happened?",
        "What's one scene from a movie or book that shaped your romantic ideals?",
        "Have you ever altered your plans to spend time with someone unexpectedly? Why?",
        "What's a gentle boundary you set that improved intimate connections?",
        "What's a subtle non-verbal cue that you find irresistible in someone?",
        "Have you ever been captivated by someone's voice? Describe how it felt.",
        "What's one tiny ritual that makes you feel connected to someone else?",
        "Have you ever had a moment of clarity about what you really want romantically?",
        "What's a favorite way to show interest that feels authentic to you?",
        "Have you ever been charmed by someone's awkwardness? Share the moment.",
        "What's one quiet way you express admiration that others might not notice?",
        "Have you ever been surprised by mutual attraction with a stranger? Tell briefly.",
        "What's one playful boundary you enjoy when getting to know someone?",
        "Have you ever shared a secret glance that turned into something more?",
        "What's a romantic quality you value that doesn't show on the surface?",
        "Have you ever been moved by a handwritten note? Describe why.",
        "What's one conversation topic that quickly deepens attraction for you?",
        "Have you ever had an affection return after a period apart? What changed?",
        "What little compliment makes you feel seen in a relationship?",
        "Have you ever taken a romantic risk that changed how you felt? What was it?",
        "What's one way you prefer to be asked on a date that feels respectful?",
        "Have you ever had a moment where words weren't needed and it felt perfect?",
        "What's a favorite, intimate memory that you revisit in your mind?",
        "Have you ever been surprised by someone else's romantic courage? Describe.",
        "What's one value you look for that indicates long-term caring?",
        "Have you ever felt deeply connected after a simple kindness? Tell us the act.",
        "What's one short phrase you hope to hear from someone who cares about you?"
      ],
      "dares": [
        "Whisper an authentic compliment to a consenting person and tell why you meant it.",
        "Write a two-line love note (tasteful) and read it aloud with feeling.",
        "Share a short memory of a time you felt deeply connected and why.",
        "Offer to plan a small, real date idea and describe how you'd make it special.",
        "Sing the first line of a romantic song softly to a consenting listener.",
        "Compose a two-line four-word poem about someone and recite it dramatically.",
        "Model a little 'date outfit' pose and hold it for a friend's photo (consent).",
        "Share a brief thank-you speech to someone who made you feel supported.",
        "Draw a tiny heart on a consenting person's hand and show it proudly.",
        "Act out a brief romantic movie trailer starring two imaginary lovers from the room.",
        "Offer a 20-second description of your perfect cozy night and why it's meaningful.",
        "Create a short list of three affectionate gestures you enjoy and explain one.",
        "Give a playful, respectful compliment to someone about their presence.",
        "Pretend to be a poet and read a short, sweet stanza you invent on the spot.",
        "Write an 'open when' note title and explain what it would say.",
        "Take a tasteful, playful photo with a consenting person and caption it with a compliment.",
        "Recite a line from a romantic book with dramatic emotion.",
        "Describe a subtle touch that you find comforting and why in 30 seconds.",
        "Do a short, consenting reenactment of a favorite romantic film pose (non-contact).",
        "Offer a gentle, sensory description of a perfect date scenario to the group.",
        "Share a 30-second story about a small romantic triumph you had.",
        "Write a two-word motto for distant relationship support and explain it.",
        "Compose a short, imaginary text you'd send to a crush and read it aloud.",
        "Demonstrate a quick, playful 'flirt' look that you'd use in real life.",
        "Make a short list of unexpected small gestures that feel romantic to you.",
        "Take a soft, consenting photo of the group's hands together and show it.",
        "Whisper a short line of appreciation to a consenting listener and explain it.",
        "Pretend to narrate a cozy dinner scene and highlight one sensory detail you love.",
        "Write a tiny 'bucket list date' item and share why you'd pick it.",
        "Give a short, candid compliment about someone's character to the group.",
        "Act out a 20-second moment of comfortable silence between two people in love.",
        "Share a quick plan for an easy surprise that would delight your partner.",
        "Compose a playful, flattering one-liner and deliver it dramatically.",
        "Offer a 30-second 'thank you' about how someone made you feel cared for.",
        "Take 10 seconds to show a gentle expression that signals affection and explain it.",
        "Perform a short, soft humming of a song that makes you think of love.",
        "Write a short 'letter teaser' describing one weekend you'd plan together.",
        "Offer a sweet micro-pledge: one small thing you'll do tomorrow to show care.",
        "Read aloud a two-line promise you would make for better listening in a relationship.",
        "Create a miniature role-play where you plan a small surprise and present it.",
        "Take a tasteful, playful portrait pose with a consenting friend and smile at the camera.",
        "Tell the group about one tiny detail you admire in someone's presence.",
        "Compose a short, kind instruction for pampering someone and explain it.",
        "Offer a 15-second voice message imitation of someone confessing appreciation.",
        "Make a short, warm toast to affection and supportive gestures.",
        "Write a two-sentence 'apology and improvement' and read it with sincerity.",
        "Share a small sensory description of touch that you find comforting and non-explicit.",
        "Pretend to be a romance narrator and describe a quiet, tender morning together.",
        "Give a 20-second pledge to start a small tradition with someone this month.",
        "Perform a short, mindful breathing exercise with a consenting partner focusing on presence.",
        "Recite a two-line affirmation about loving-kindness and dedicate it to a friend.",
        "Draw a tiny symbolic doodle for someone (consent) and interpret it aloud.",
        "Read a short, respectful love quote and explain why it resonates for you.",
        "Make a quick, playful list of three date snacks you would prepare and explain the first choice."
      ]
    },
    "sex_mate": {
      "truths": [
        "What boundary around intimacy do you consider non-negotiable? Explain briefly.",
        "What's a respectful way a partner can ask for consent you appreciate?",
        "Have you ever communicated a preference that surprised your partner? What was it?",
        "What emotional quality do you find most attractive in intimate partners?",
        "What's one intimate communication you wish was clearer in most encounters?",
        "Have you ever set a boundary that improved an intimate relationship? Describe briefly.",
        "What's a small gesture during intimacy that makes you feel safe and cared for?",
        "Have you ever been relieved when a partner took your consent seriously? Tell us why.",
        "What's one non-physical aspect that makes intimacy feel meaningful to you?",
        "Have you ever expressed a fantasy in a respectful way and had it received well? Share lightly.",
        "What's a line you use to confirm consent that feels natural to you?",
        "What's one thing you always ask about before becoming intimate with someone?",
        "Have you ever found a simple signal that improved communication during closeness? Describe.",
        "What's a rule you set for yourself about respecting partners' boundaries?",
        "Have you ever turned down an intimate advance and felt proud of your boundary? Share briefly.",
        "What's a reassuring phrase you'd like a partner to say before intimacy?",
        "What's a small post-intimacy practice that makes you feel connected?",
        "Have you ever discussed safe words or signals? How did it help?",
        "What's one thing you want all partners to know about listening during intimacy?",
        "Have you ever been pleasantly surprised by someone's gentle attentiveness? Tell briefly.",
        "What's one consideration that makes casual intimacy feel safe to you?",
        "Have you ever negotiated a boundary that led to greater trust? Describe in one sentence.",
        "What's one question you like to ask before intimate moments to ensure comfort?",
        "Have you ever discovered a preference you didn't expect? What did you learn?",
        "What's one small aftercare gesture that means a lot to you?",
        "Have you ever felt grateful when a partner checked in afterward? Describe why.",
        "What's a respectful way to decline an advance that you prefer?",
        "Have you ever had a conversation that improved intimacy through clearer communication? Share briefly.",
        "What's one thing you'd like people to understand about mutual consent?",
        "Have you ever felt more attracted after a deep, honest conversation? Describe the moment.",
        "What's a gentle boundary that you've explained and had respected? What was it?",
        "Have you ever regretted not communicating something important? What would you change?",
        "What's one thing you look for in a partner's behavior to feel safe?",
        "Have you ever been surprised by how vulnerability improved closeness? Explain briefly.",
        "What's a short phrase you appreciate hearing before becoming intimate?",
        "Have you ever set a boundary to preserve future trust? Tell us succinctly.",
        "What's one intimate preference you wish more people asked about respectfully?",
        "Have you ever felt that consent was beautifully handled? What did they do?",
        "What's a communication habit that helps intimacy feel mutual and kind?",
        "Have you ever adjusted a boundary after a conversation and felt relieved? Describe.",
        "What's one thing you would tell someone about navigating consent with care?",
        "Have you ever had a candid conversation that deepened mutual respect? Share briefly.",
        "What's a small ritual you'd request for comfort after closeness?",
        "Have you ever been surprised by how listening changed the experience? Explain in one line.",
        "What's one gentle way you prefer to be asked about preferences?",
        "Have you ever shared a boundary that improved everyone's experience? Describe shortly.",
        "What's a supportive question a partner can ask that would mean a lot to you?",
        "Have you ever turned down something and later discussed it productively? What happened?",
        "What's one simple action a partner can take to show they respect your limits?",
        "Have you ever felt safer after someone checked in? What phrase helped?",
        "What's one thing you want to always communicate before intimacy begins?",
        "Have you ever been pleasantly surprised by compassionate response to a boundary? Tell briefly.",
        "What's one aftercare action that you consider important and why?",
        "Have you ever had an awkward conversation that ended in mutual understanding? Share briefly.",
        "What's one short rule you follow to make sure intimacy is always consensual and kind?",
        "Have you ever appreciated a partner repeating back your boundary to confirm? Explain.",
        "What's a small question you ask to ensure clarity before getting closer?",
        "Have you ever redefined intimacy with someone through conversation? What changed?",
        "What's one respectful practice you'd include in any intimate encounter?"
      ],
      "dares": [
        "Offer a consenting partner a tasteful compliment about their presence and explain why you mean it.",
        "Share a short, respectful phrase you use to check consent and demonstrate it out loud.",
        "Describe a simple post-intimacy care action you would do to be supportive and kind.",
        "Ask a consenting person one clear question about a preference and listen attentively to their answer.",
        "Write a respectful, non-graphic sentence about what makes you feel safe and read it aloud.",
        "Suggest a gentle breathing or grounding exercise for two people and lead it for thirty seconds (consent).",
        "Propose a short, mutual handshake of consent words before an imagined intimate scene and demonstrate.",
        "Offer to role-play a short consent-check scenario showing how you'd ask and receive a clear yes/no.",
        "Share a single, reassuring phrase you would like to hear before intimacy and say it to a consenting listener.",
        "Speak a one-sentence aftercare plan you'd appreciate and explain why it comforts you.",
        "Ask a consenting player to name one boundary and repeat it back to confirm understanding.",
        "Describe a simple, comforting touch (non-sexual) you'd use after closeness and explain why it helps.",
        "Offer a short, kind reflection on how to respect space and boundary in one sentence.",
        "Demonstrate (verbally) a clear way to decline something kindly and roleplay it with consent.",
        "Tell a consenting partner one small thing you'd do to ensure they feel respected afterward.",
        "Share a short example of a graceful apology you might give if you crossed a minor boundary.",
        "Suggest a neutral signal (like 'pause') and practice how you'd use it with a consenting partner.",
        "Say one non-graphic affectionate phrase you'd like to hear and explain its meaning to you.",
        "Offer a brief consent checklist (3 items) you'd like partners to check with you and read it aloud.",
        "Describe a soft cue you'd give if you wanted a pause and practice saying it with a friend (consent).",
        "Propose a single reassuring question to ask after intimacy and demonstrate it once.",
        "Explain in one sentence how you'd check in about comfort before trying something new (consent).",
        "Share a short, clear sentence you would say to decline something respectfully and practice it.",
        "Offer a brief aftercare suggestion that includes one caring action you value.",
        "Ask a consenting listener to name one preference and agree to honor it out loud.",
        "Describe a short routine for mutual consent reminders and present it as a short pledge.",
        "Tell a consenting partner one small non-sexual gesture you find deeply comforting.",
        "Practice saying 'Are you comfortable with X?' with a clear pause for answer with a consenting friend.",
        "Describe, in one sentence, how to ensure emotional safety during a close moment.",
        "Offer a short affirmation you'd appreciate hearing after intimacy and explain why.",
        "Suggest a small comfort routine for two people and illustrate it in a single sentence.",
        "Practice checking in by asking one clear question and pausing for the response (consent required).",
        "Offer a kind, non-judgmental phrase to use when someone declines and roleplay it once.",
        "Share a short suggestion for how to create a calm, respectful space before closeness.",
        "Demonstrate a single sentence that can help de-escalate pressure and practice it aloud.",
        "Propose a two-line agreement for safe play and read it with a consenting partner.",
        "Offer to name and honor one boundary someone gives and repeat it back to show respect.",
        "Describe a single aftercare action you would offer and explain its comfort in one line.",
        "Practice a short phrase for mutual enthusiasm check and say it with a consenting friend.",
        "Write and read a 2-line guide for respectful intimacy emphasizing consent and listening.",
        "Suggest a short set of steps to ensure both partners feel heard and model it once.",
        "Offer a small question to open communication about preferences and demonstrate asking it.",
        "Share a one-sentence boundary that you would want repeated back to you to confirm understanding.",
        "Practice offering a careful apology phrase for a minor uncomfortable moment and say it aloud.",
        "Propose a short, kind signal to use if someone misreads a cue and practice using it (consent).",
        "Describe a single aftercare phrase and read it gently to the group with permission.",
        "Practice asking 'Do you want me to continue?' and pause for an answer with a consenting partner.",
        "Offer a brief, reassuring sentence you might say after an intense emotional moment and read it aloud.",
        "Write a short, caring 'if you need space' sentence and read it to a consenting listener.",
        "Suggest a simple temperature-check question for mutual comfort and say it once.",
        "Demonstrate a sensitive wording for declining that preserves respect and practice the delivery.",
        "Offer a two-sentence model for initiating a conversation about boundaries and read it.",
        "Practice a clear 'stop' phrase that feels confident and respectful and say it aloud once.",
        "Describe a short ritual that promotes emotional safety and explain how you'd use it, briefly.",
        "Invite a consenting partner to share one must-have boundary and repeat it back as assurance."
      ]
    }
  }
}
